
"""
== Лото ==
Правила гри у лото.
Гра ведеться за допомогою спеціальних карток, на яких відзначені числа,
та фішок (бочки) з цифрами.
Кількість барил — 90 штук (з цифрами від 1 до 90).
Кожна картка містить 3 рядки по 9 клітинок. У кожному рядку по 5 випадкових цифр,
розташованих за зростанням. Усі цифри у картці унікальні. Приклад картки:

--------------------------
    9 43 62          74 90
 2    27    75 78    82
   41 56 63     76      86 
--------------------------

У грі 2 гравці: користувач та комп'ютер. Кожному на початку видається
довільна картка.

Кожен хід вибирається одне випадкове барило і виводиться на екран.
Також виводяться картка гравця та картка комп'ютера.
Користувачеві пропонується закреслити цифру на картці або продовжити.

Якщо гравець вибрав "закреслити":
  Якщо цифра є на картці – вона закреслюється і гра продовжується.
  Якщо цифри на картці немає – гравець програє та гра завершується.
Якщо гравець вибрав "продовжити":
  Якщо цифра є на картці – гравець програє та гра завершується.
  Якщо цифри на картці немає – гра продовжується.
Перемагає той, хто перший закриє усі числа на своїй картці.

Приклад одного ходу:
Нова барило: 70 (залишилося 76)
------ Ваша карточка -----
 6  7          49    57 58
   14 26     -    78    85
23 33    38    48    71   
--------------------------
-- Карточка комп'ютера ---
 7 11     - 14    87      
      16 49    55 77    88    
   15 20     -       76  -
--------------------------
Закреслити цифру? (y/n)
Підказка: кожна наступна випадкова барило з мішка зручно отримувати
за допомогою функції-генератора.
Підказка: для роботи з псевдовипадковими числами зручно використовувати
модуль random: http://docs.python.org/3/library/random.html

"""
